###############################################################
#  Generated by:      Cadence Encounter 10.13-s272_1
#  OS:                Linux x86_64(Host ID ws34)
#  Generated on:      Thu May 26 16:47:32 2016
#  Design:            square_root_finder
#  Command:           saveDesign square_root_finder.enc
###############################################################
set sdc_version 1.4
current_design square_root_finder
create_clock [get_ports {clk}]  -name clk -period 20 -waveform {0 10}
set_propagated_clock  [get_ports {clk}]
